app/graphql/resolvers/concerns/collection.rb

      def base_scope
        case model_class.to_s
        when 'Types::UserType'
          User.all
---
SELECT "users".* FROM "users"