app/graphql/mutations/create_user.rb

INSERT INTO "users" ("email", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "pokus@pokus.cz"], ["name", "pokus"], ["created_at", "2021-01-06 15:14:32.280815"], ["updated_at", "2021-01-06 15:14:32.280815"]]
---
  def resolve(name:, email:)
    user = User.new(name: name, email: email)

    if(user.save)