app/graphql/types/query_type.rb

SELECT "users".* FROM "users"
---
    def users(args = {})
      res = args[:id] ? User.find(args[:id]) : User.all
      res = res.drop(args[:offset]) if args[:offset]
      res = res.take(args[:limit]) if args[:limit]

SELECT COUNT(*) FROM "users"
---
    def users_count
      User.all.size

SELECT COUNT(*) FROM "posts"
---
    def posts_count
      Post.all.size