app/graphql/types/query_type.rb

SELECT  "users".* FROM "users" LIMIT ?  [["LIMIT", 40]]
---
    def users(args)
      res = User.all
      res = res.drop(args[:offset]) if args[:offset]
      res = res.take(args[:limit]) if args[:limit]