app/graphql/types/user_type.rb

SELECT "posts".* FROM "posts"
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
---
    def posts_count
      object.posts.size